# Agenda

* Introduction to Pandas
* Pandas Data Structures [ Series, DataFrame, Panel] Creation and Accessing
* Indexing and Selecting [loc, iloc, ix ]

## Introduction to Pandas

* Pandas - High-Performance open source library for data analysis
* Process datasets of different formats - time series, tabular data, matrix data
* Import data from csv,json & database
* Provides extensive operations like slice,subset,merging, groupby,shaping etc.
* Handling missing data
* Doing statiscal analysis
* Pandas objects are consumed by scikit-learn,tensorflow

In [2]:
import pandas as pd

## Data Structures in Pandas
* Series - 1D NumPY array with indexed column
* DataFrame - Tabular data with hetrogenous columns
* Panel - A panel is a 3D container of data

### Series [ pd.Series() ]
#### Creation of series with index information
* 1D labeled homogeneous array, size immutable.

In [3]:
ser1 = pd.Series(data=[1,2,3,4,5], index=['A','B','C','D','E'])

In [4]:
ser1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [5]:
ser1.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [6]:
ser1.values

array([1, 2, 3, 4, 5], dtype=int64)

#### Accessing elements from series object by index
* Value is inclusive

In [9]:
ser1[:'c']

A    1
B    2
C    3
D    4
E    5
dtype: int64

#### Creating series object with default index

In [10]:
ser2 = pd.Series([1,2,3])

In [11]:
ser2

0    1
1    2
2    3
dtype: int64

#### Convert dictionary to series or Creation of series from dict

In [12]:
db = {'abc':'hello','def':'yello','jkl':'good'}

In [13]:
pd.Series(db)

abc    hello
def    yello
jkl     good
dtype: object

#### Convert scalar value to seriesÂ¶
* If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [12]:
pd.Series(5, index=[0, 1, 2, 3])

0    5
1    5
2    5
3    5
dtype: int64

#### Accessing series data by  index label vs Accessing series data by  index

In [20]:
ser1 = pd.Series(data=[5,6,6,7], index=['a','b','c','d'])

#### Retrieve a single element using index label value

* Access by index values
* Value is inclusive

In [21]:
ser1[:'c']

a    5
b    6
c    6
dtype: int64

**Retrieve a single element using index label value**

* Access by index numbers
* Index number is exclusive

In [22]:
ser1[:2]

a    5
b    6
dtype: int64

In [23]:
ser1['b':'d']

b    6
c    6
d    7
dtype: int64

#### Append - Combine two series

In [24]:
ser1.append(ser2)

a    5
b    6
c    6
d    7
0    1
1    2
2    3
dtype: int64

#### coverting series to dictionary

In [25]:
ser1.to_dict()

{'a': 5, 'b': 6, 'c': 6, 'd': 7}

### DataFrames [ pd.DataFrame() ]

* Analogous to spreadsheet
* General 2D labeled
* Collection of series
* Mutable - Contents changeable
* Heterogeneous - different cols with different type of data
* Size Mutable
* Data Mutable
* Can perform arithmetic operations on rows and columns

#### Create dataframe from multiple series

In [29]:
ser1 = pd.Series([100,200,300,400], index=['a','b','c','d'])

In [30]:
ser2 = pd.Series([222,333,444,555,666], index=['a','c','d','b','e'])

In [31]:
df = pd.DataFrame({
    's1':ser1,
    's2':ser2
})

In [32]:
df

      s1   s2
a  100.0  222
b  200.0  555
c  300.0  333
d  400.0  444
e    NaN  666

#### Access column(series)

In [34]:
df['s1']

a    100.0
b    200.0
c    300.0
d    400.0
e      NaN
Name: s1, dtype: float64

#### Accessing with double bracket returns a dataframe

In [35]:
df[['s1','s2']]

      s1   s2
a  100.0  222
b  200.0  555
c  300.0  333
d  400.0  444
e    NaN  666

#### Delete a column

In [36]:
del df['s1']

In [37]:
df

    s2
a  222
b  555
c  333
d  444
e  666

#### Add a new columnÂ¶

In [40]:
ser3 = pd.Series(data=[1,2,3,4,5], index=['a','b','b','c','d'])

In [41]:
df['s3'] = df.s2 + 100

In [42]:
df

    s2   s3
a  222  322
b  555  655
c  333  433
d  444  544
e  666  766

In [43]:
s4 = pd.Series('hello', index=df.index)

In [44]:
s4

a    hello
b    hello
c    hello
d    hello
e    hello
dtype: object

In [45]:
df['s4'] = s4

In [46]:
df

    s2   s3     s4
a  222  322  hello
b  555  655  hello
c  333  433  hello
d  444  544  hello
e  666  766  hello

#### Create dataframe from numpy

In [47]:
import numpy as np

In [48]:
pd.DataFrame(np.array([[1,2,3,4,5],[1,2,3,4,5]]),index=['a','b'],columns=['a','b','c','d','e'])

   a  b  c  d  e
a  1  2  3  4  5
b  1  2  3  4  5

#### Create a DataFrame from Dict of Series

In [49]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

#### Creating from diffrent file formats

#### importing csv file from pandas

In [56]:
hr_data=pd.read_csv('HR_comma_sep.csv')

#### head function returns the first n rows.(default 5rows)

In [57]:
hr_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

#### tail function Returns the last n rows.(default 5rows)Â¶

In [58]:
hr_data.tail()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
14994,0.40,0.57,2,151,3,0,1,0,support,low
14995,0.37,0.48,2,160,3,0,1,0,support,low
14996,0.37,0.53,2,143,3,0,1,0,support,low
14997,0.11,0.96,6,280,4,0,1,0,support,low
14998,0.37,0.52,2,158,3,0,1,0,support,low

#### columns function returns all columns in the table

In [59]:
hr_data.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'sales', 'salary'],
      dtype='object')

#### info returns the brief information of all the columns with its specifications

In [60]:
hr_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
satisfaction_level       14999 non-null float64
last_evaluation          14999 non-null float64
number_project           14999 non-null int64
average_montly_hours     14999 non-null int64
time_spend_company       14999 non-null int64
Work_accident            14999 non-null int64
left                     14999 non-null int64
promotion_last_5years    14999 non-null int64
sales                    14999 non-null object
salary                   14999 non-null object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

#### dexcribe() function returns the mathematical relations of the columns with different functions which are seen below in example

In [61]:
hr_data.describe()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

### Indexing & Selecting

#### we are accesing the data of selected indexes

In [62]:
hr_data[1:3]

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium

#### .loc - access value by index
* .loc is primarily label based, but may also be used with a boolean array. .loc will raise KeyError when the items are not found.

*  In below line we are fetching satisfaction_level values upto 5th index

In [63]:
hr_data.loc[:5,'satisfaction_level']

0    0.38
1    0.80
2    0.11
3    0.72
4    0.37
5    0.41
Name: satisfaction_level, dtype: float64

In [64]:
hr_data.loc[0:4]

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

#### .iloc is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

In [65]:
hr_data.iloc[0:4]

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low

## .ix()
* The ix[] indexer is a hybrid of .loc and .iloc. Generally, ix is label based and acts just as the .loc indexer. However, .ix also supports integer type selections (as in .iloc) where passed an integer. This only works where the index of the DataFrame is not integer based. ix will accept any of the inputs of .loc and .iloc.

#### .ix indexing works just the same as .loc when passed strings

In [68]:
hr_data.ix[:5,'satisfaction_level']

0    0.38
1    0.80
2    0.11
3    0.72
4    0.37
5    0.41
Name: satisfaction_level, dtype: float64

In [69]:
hr_data.ix[:5,'satisfaction_level'] == hr_data.loc[:5,'satisfaction_level']

0    True
1    True
2    True
3    True
4    True
5    True
Name: satisfaction_level, dtype: bool

#### .ix indexing works the same as .iloc when passed integers

In [70]:
hr_data.ix[0:4]

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

####  Creating and Accessing DataFrame from json file

In [71]:
movie_data=pd.read_json('movie.json')

In [72]:
movie_data

,Adam Cohen,Bill Duffy,Brenda Peterson,Chris Duncan,Clarissa Jackson,David Smith,Julie Hammel,Samuel Miller
Goodfellas,4.5,4.5,2.0,NaN,2.5,4.5,3.0,5.0
Raging Bull,NaN,NaN,1.0,4.5,4.0,3.0,NaN,5.0
Roman Holiday,3.0,NaN,4.5,NaN,1.5,NaN,4.5,1.0
Scarface,3.0,5.0,1.5,NaN,4.5,4.5,2.5,3.5
The Apartment,1.0,1.0,5.0,1.5,1.0,1.0,NaN,1.0
Vertigo,3.5,4.5,3.0,NaN,5.0,4.0,NaN,NaN

In [73]:
movie_data.columns

Index(['Adam Cohen', 'Bill Duffy', 'Brenda Peterson', 'Chris Duncan',
       'Clarissa Jackson', 'David Smith', 'Julie Hammel', 'Samuel Miller'],
      dtype='object')

In [74]:
movie_data.index

Index(['Goodfellas', 'Raging Bull', 'Roman Holiday', 'Scarface',
       'The Apartment', 'Vertigo'],
      dtype='object')

In [75]:
movie_data.loc['Goodfellas':'Scarface']

,Adam Cohen,Bill Duffy,Brenda Peterson,Chris Duncan,Clarissa Jackson,David Smith,Julie Hammel,Samuel Miller
Goodfellas,4.5,4.5,2.0,NaN,2.5,4.5,3.0,5.0
Raging Bull,NaN,NaN,1.0,4.5,4.0,3.0,NaN,5.0
Roman Holiday,3.0,NaN,4.5,NaN,1.5,NaN,4.5,1.0
Scarface,3.0,5.0,1.5,NaN,4.5,4.5,2.5,3.5

In [76]:
movie_data.iloc[0:3]

,Adam Cohen,Bill Duffy,Brenda Peterson,Chris Duncan,Clarissa Jackson,David Smith,Julie Hammel,Samuel Miller
Goodfellas,4.5,4.5,2.0,NaN,2.5,4.5,3.0,5.0
Raging Bull,NaN,NaN,1.0,4.5,4.0,3.0,NaN,5.0
Roman Holiday,3.0,NaN,4.5,NaN,1.5,NaN,4.5,1.0

#### Filtering when accessing

In [77]:
movie_data.loc[movie_data['Samuel Miller'] > 3]

,Adam Cohen,Bill Duffy,Brenda Peterson,Chris Duncan,Clarissa Jackson,David Smith,Julie Hammel,Samuel Miller
Goodfellas,4.5,4.5,2.0,NaN,2.5,4.5,3.0,5.0
Raging Bull,NaN,NaN,1.0,4.5,4.0,3.0,NaN,5.0
Scarface,3.0,5.0,1.5,NaN,4.5,4.5,2.5,3.5

* movie_data['Samuel Miller'] > 3 returns a boolean array with indexes retained
* movie_data.iloc[movie_data['Samuel Miller'] > 3] won't work

#### Filling while ReIndexing

In [62]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])

In [63]:
df1

       col1      col2      col3
0  2.636422 -0.760029  1.431162
1  0.301554 -0.193393  1.232438
2 -0.162892 -0.420424 -1.423843
3  1.158061  1.470243 -0.554458
4 -1.173546 -0.012436 -0.142484
5  1.388466  0.022154  0.091552

In [64]:
df2

       col1      col2      col3
0  2.374092 -1.454633  0.167902
1 -0.930514  0.777997 -1.086217

In [65]:
df1.reindex_like(df2)

       col1      col2      col3
0  2.636422 -0.760029  1.431162
1  0.301554 -0.193393  1.232438

In [66]:
df1.shape

(6, 3)

### Panel [ pd.panel() ]

* A panel is a 3D container of data<br/>


* The names for the 3 axes are intended to give some meaning to describing operations involving panel data.
    * items â axis 0, each item corresponds to a DataFrame contained inside.<br/>
    
    * major_axis â axis 1, it is the index (rows) of each of the DataFrames.<br/>
    
    * minor_axis â axis 2, it is the columns of each of the DataFrames.<br/>

#### Creation of panel

#### pandas.Panel(data, items, major_axis, minor_axis, dtype, copy)
* items	axis=0
* major_axis	axis=1
* minor_axis	axis=2

In [50]:
data = np.random.rand(2,4,5)
p = pd.Panel(data)
p

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 5 (minor_axis)
Items axis: 0 to 1
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 4

#### From dict of DataFrame Object

In [51]:
data = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
        'Item2' : pd.DataFrame(np.random.randn(4, 2))}
p = pd.Panel(data)
p

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 3 (minor_axis)
Items axis: Item1 to Item2
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 2

#### Selecting the Data from Panel

In [52]:
data = {'Item1' : pd.DataFrame(np.random.randn(4, 4)), 
        'Item2' : pd.DataFrame(np.random.randn(4, 4))}
p = pd.Panel(data)
p['Item2']

          0         1         2         3
0  2.601395  1.106313 -1.812662 -0.216468
1 -0.617380 -0.248720 -0.277108  0.699655
2 -1.200427  0.612594 -0.712826 -0.271736
3 -1.577758  0.835616  0.463373 -0.367215

#### Data can be accessed using the method panel.major_axis(index)

In [53]:
data = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
        'Item2' : pd.DataFrame(np.random.randn(4, 2))}
p = pd.Panel(data)
p.major_xs(1)

      Item1     Item2
0  0.369187  0.783860
1  0.713098 -0.176272
2 -1.153522       NaN

#### Data can be accessed using the method panel.minor_axis(index).

In [54]:
data = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
        'Item2' : pd.DataFrame(np.random.randn(4, 2))}
p = pd.Panel(data)
p.minor_xs(1)

      Item1     Item2
0 -1.347137 -0.542701
1  1.373895  0.672628
2 -0.375110  1.156380
3 -0.615297  1.540918

## Conclusion

In this chapter we have seen what is Pandas Library, and creation of pandas data structures and Accessing elements.
In the next chapter we will learn Pandas Basic Functions.